Tekla Open API Reference for Tekla Structures 2025
WeldMark.WeldMarkAttributes.SeamBelow Property
 The visibility of the seam below parameters.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public WeldMark.SeamVisibilityAttributes SeamBelow { get; set; }
Public Property SeamBelow As WeldMark.SeamVisibilityAttributes
	Get
	Set
Property Value
Type: WeldMark.SeamVisibilityAttributes
See Also
Reference
WeldMark.WeldMarkAttributes Class
Tekla.Structures.Drawing Namespace